Repository: jimregan/citizens-information-raw
Catalog: en-ga/www.citizensinformation.ie/ga/justice/courts_system/commercial_court.html.txt.tmx
Source language: en
Languages: ga

source: The Commercial Court is a division of the High Court and was established in 2004 to provide efficient and effective dispute resolution in commercial cases
ga: Is cuid den Ard-Chúirt é an Chúirt Tráchtála agus bunaíodh í sa bhliain 2004 chun taifeach díospóide feidhmiúla agus éifeachtaí a sholáthar i gcásanna tráchtála

source: It is governed by Order 63A of the Rules of the Superior Courts in particular
ga: Tá sé rialaithe ag Ordú 63A de Rialacha na nUaschúirteanna ach go háirithe

source: The Commercial Court deals with the following type of business disputes:
ga: Déileálann an Chúirt Tráchtála leis na cineálacha díospóidí gnó seo a leanas:

source: • Disputes of a commercial nature between commercial bodies where the value of the claim is at least €1 million
ga: • Díospóidí de bhunú tráchtála idir eagraíochtaí tráchtála nuair atá luach an éilimh ar a laghad €1 milliún

source: • Proceedings under the Arbitration Act 2010 with a value of at least €1 million
ga: • Cásanna faoin Acht Eadrána le luach de €1 milliún ar a laghad

source: • Disputes concerning intellectual property
ga: • Díospóidí maidir le maoin intleachtúil

source: • Appeals from or applications for judicial review of regulatory decisions
ga: • Achomhairc ó nó iarratais ar athbhreithniú breithiúnach de bhreitheanna rialála

source: • Proceedings in connection with any function of the Registrar under the Cape Town Convention or the Aircraft Protocol as defined in the International Interests in Mobile Equipment (Cape Town Convention) Act 2005
ga: • Imeachtaí gaolta le haon fheidhm den Chláraitheoir faoin gCoinbhinsiún Cape Town nó an Comhghnás Aerárthaí mar atá sainithe san Acht um Leasanna Idirnáisiúnta i dTrealamh Soghluaiste (Coinbhinsiún Cape Town) 2005

source: • Other cases a judge of the Commercial Court considers appropriate
ga: • Cásanna eile a mheasann breitheamh na Cúirte Tráchtála a bheith cuí

source: There is no automatic right of entry to the Commercial List of the High Court
ga: Níl aon cheart dhul isteach uathoibríoch ar Liosta Tráchtála na hArd-Chúirte

source: It is at the discretion of a judge of the Commercial Court
ga: Tá sé faoi dhiscréid bhreitheamh na Cúirte Tráchtála

source: The Court uses a detailed case management system that is designed to streamline the preparation for trial, remove unnecessary costs and stalling tactics, and ensure full pre-trial disclosure
ga: Baineann an Chúirt úsáid as córas bainistithe cáis mhin atá deartha chun an ullmhúchán do thriail a luathú, costais nach bhfuil ag teastáil agus beartaíochtaí loichte a bhaint den phróiseas, agus nochtadh réamh-thrialach iomláin a chinntiú

source: The judge can adjourn proceedings for up to 28 days to allow resolution of the dispute through some form of alternative dispute resolution, such as mediation, conciliation or arbitration
ga: Is féidir leis an mbreitheamh imeachtaí a chur ar athló go dtí suas go 28 lá chun taifeach na díospóide a éascú trí thaifeach díospóide de shaghas éigin eile, cosúil le hidirghabháil, idir-réiteach nó eadráin
